<template>
  <div>
    <div class="page-loadmore">
      <mt-loadmore  :bottom-method="loadBottom" @bottom-status-change="handleBottomChange" :bottom-all-loaded="allLoaded" ref="loadmore">
        <ul class="kc_part">
          <li v-for="(aa,index) in ad" v-if="index<num"><div style="width: 100px; height: 100px; margin-right: 10px;"><img :src="aa.logo" width="100px"  height="100px"></div><div class="text"><h3>{{aa.tit}}</h3><p>{{aa.text}}</p></div></li>
        </ul>
      </mt-loadmore>
    </div>
  </div>
</template>

<style>

</style>

<script type="text/babel">
  export default {
    data() {
      return {
        hz:[
          {tit:'杭州西湖',logo:require('../assets/image/hz1.jpg'),text:'西湖古称“钱塘湖”，又名“西子湖”，古代诗人苏轼就对它评价道：“欲把西湖比西子，淡妆浓抹总相宜。”西湖形态为近于等轴的多边形，湖面被孤山及苏堤、白堤两条人工堤分割为5个子湖区，子湖区间由桥孔连通，各部分的湖水不能充分掺混，造成各湖区水质差异，大部分径流补给先进入西侧3个子湖区，再进入外西湖；湖水总面积5.593平方公里;，总容积1．10亿立方米，平均水深1．97 米；'},
          {tit:'杭州千岛湖',logo:require('../assets/image/hz2.jpg'),text:'杭州市千岛湖风景名胜区位于中国浙江杭州西效淳安县境内的千岛湖，东距杭州129公里、西距黄山140公里，是长江三角洲地区的后花园，景区内碧水呈奇，千岛百姿 ，自然风光旖旎，生态环境佳绝，因湖内拥有1078座翠岛而得名。千岛湖以千岛、秀水、金腰带 （岛屿与湖水相接处环绕着有一层金黄色的土带，称之名 “金腰带”） 为主要特色景观。千岛湖是中国首批国家级风景名胜区之一，也是中国面积最大的森林公园 ，是“杭州——千岛湖——黄山”名山名水名城黄金旅游线上的一颗璀璨明珠。'},
          {tit:'杭州宋城',logo:require('../assets/image/hz3.jpg'),text:'杭州宋城旅游景区位于西湖风景区西南，北依五云山、南濒钱塘江，是中国最大的宋文化主题公园，由杭州世界城宋城置业有限公司投资兴建。'},
          {tit:'杭州西湖',logo:require('../assets/image/hz1.jpg'),text:'西湖古称“钱塘湖”，又名“西子湖”，古代诗人苏轼就对它评价道：“欲把西湖比西子，淡妆浓抹总相宜。”西湖形态为近于等轴的多边形，湖面被孤山及苏堤、白堤两条人工堤分割为5个子湖区，子湖区间由桥孔连通，各部分的湖水不能充分掺混，造成各湖区水质差异，大部分径流补给先进入西侧3个子湖区，再进入外西湖；湖水总面积5.593平方公里;，总容积1．10亿立方米，平均水深1．97 米；'},
          {tit:'杭州千岛湖',logo:require('../assets/image/hz2.jpg'),text:'杭州市千岛湖风景名胜区位于中国浙江杭州西效淳安县境内的千岛湖，东距杭州129公里、西距黄山140公里，是长江三角洲地区的后花园，景区内碧水呈奇，千岛百姿 ，自然风光旖旎，生态环境佳绝，因湖内拥有1078座翠岛而得名。千岛湖以千岛、秀水、金腰带 （岛屿与湖水相接处环绕着有一层金黄色的土带，称之名 “金腰带”） 为主要特色景观。千岛湖是中国首批国家级风景名胜区之一，也是中国面积最大的森林公园 ，是“杭州——千岛湖——黄山”名山名水名城黄金旅游线上的一颗璀璨明珠。'},
          {tit:'杭州宋城',logo:require('../assets/image/hz3.jpg'),text:'杭州宋城旅游景区位于西湖风景区西南，北依五云山、南濒钱塘江，是中国最大的宋文化主题公园，由杭州世界城宋城置业有限公司投资兴建。'}
        ],
        bj:[
          {tit:'北京故宫博物院',logo:require('../assets/image/bj1.jpg'),text:'故宫位于北京市中心，也称“紫禁城”。这里曾居住过24个皇帝，是明清两代（公元1368～1911年）的皇宫，现辟为“故宫博物院”。'},
          {tit:'北京颐和园',logo:require('../assets/image/bj2.jpg'),text:'颐和园位于北京西北郊，主要由万寿山和昆明湖组成。早在元明时期，这里就以其优美自然的田园景色成为“壮观神州第一”的著名游览胜地。'},
          {tit:'北京八达岭长城',logo:require('../assets/image/bj3.jpg'),text:'八达岭长城史称天下九塞之一，是万里长城的精华，在明长城中，独具代表性。八达岭长城是万里长城向游人开得最早的地段，八达岭景区以八达岭长城为主，兴建了八达岭饭店、全周影院和由江泽民主席亲笔题名的中国长城博物馆等功能齐全的现代化旅游服务设施。'},
          {tit:'北京故宫博物院',logo:require('../assets/image/bj1.jpg'),text:'故宫位于北京市中心，也称“紫禁城”。这里曾居住过24个皇帝，是明清两代（公元1368～1911年）的皇宫，现辟为“故宫博物院”。'},
          {tit:'北京颐和园',logo:require('../assets/image/bj2.jpg'),text:'颐和园位于北京西北郊，主要由万寿山和昆明湖组成。早在元明时期，这里就以其优美自然的田园景色成为“壮观神州第一”的著名游览胜地。'},
          {tit:'北京八达岭长城',logo:require('../assets/image/bj3.jpg'),text:'八达岭长城史称天下九塞之一，是万里长城的精华，在明长城中，独具代表性。八达岭长城是万里长城向游人开得最早的地段，八达岭景区以八达岭长城为主，兴建了八达岭饭店、全周影院和由江泽民主席亲笔题名的中国长城博物馆等功能齐全的现代化旅游服务设施。'}
          ],
        nj:[
          {tit:'南京夫子庙',logo:require('../assets/image/nj1.jpg'),text:'南京夫子庙，常简称夫子庙，是一座位于南京市秦淮河北岸贡院街的孔庙。“夫子”是孔子弟子对孔子的尊称。目前以夫子庙为中心、庙市街景合一的秦淮风光景区是集文化、旅游、购物、服务等功能于一体的文化活动中心。附近有夫子庙小学。'},
          {tit:'中山陵园风景区',logo:require('../assets/image/nj2.jpg'),text:'中山陵是被称为中华民国国父、中国民主革命先行者的孙中山的陵墓，位于江苏省南京市东郊紫金山南麓，东邻灵谷寺、西毗明孝陵。'},
          {tit:'南京钟山',logo:require('../assets/image/nj3.jpg'),text:'钟山风景名胜区位于江苏省南京市，以钟山（紫金山）和玄武湖为中心。钟山风景名胜区蜿蜒起伏，宛如游龙，包括紫金山、明代城垣、玄武湖，山、湖的连接地带以及环湖的富贵山、覆舟山、鸡笼山等若干低丘和城垣、城堡。'},
          {tit:'南京夫子庙',logo:require('../assets/image/nj1.jpg'),text:'南京夫子庙，常简称夫子庙，是一座位于南京市秦淮河北岸贡院街的孔庙。“夫子”是孔子弟子对孔子的尊称。目前以夫子庙为中心、庙市街景合一的秦淮风光景区是集文化、旅游、购物、服务等功能于一体的文化活动中心。附近有夫子庙小学。'},
          {tit:'中山陵园风景区',logo:require('../assets/image/nj2.jpg'),text:'中山陵是被称为中华民国国父、中国民主革命先行者的孙中山的陵墓，位于江苏省南京市东郊紫金山南麓，东邻灵谷寺、西毗明孝陵。'},
          {tit:'南京钟山',logo:require('../assets/image/nj3.jpg'),text:'钟山风景名胜区位于江苏省南京市，以钟山（紫金山）和玄武湖为中心。钟山风景名胜区蜿蜒起伏，宛如游龙，包括紫金山、明代城垣、玄武湖，山、湖的连接地带以及环湖的富贵山、覆舟山、鸡笼山等若干低丘和城垣、城堡。'}
        ],
        xa:[
          {tit:'秦始皇兵马俑',logo:require('../assets/image/xa1.jpg'),text:'兵马俑全称：西安市秦始皇兵马俑博物馆.秦始皇兵马俑博物馆坐落在距西安37千米的临潼县城东，南倚骊山，北临渭水，气势宏伟，是全国重点的文物保护单位。'},
          {tit:'西安华清池',logo:require('../assets/image/xa2.jpg'),text:'盛唐皇家宫苑 中国唐文化旅游标志性景区.华清池，亦名华清宫。东距西安23公里。紧依京畿的地理位置，旖旎秀美的山水风光，自然造化的山地温泉，让周、秦、汉、隋、唐历代帝王皆在此营建离宫别苑，享受天然的旖旎风情。'},
          {tit:'西安大唐芙蓉园',logo:require('../assets/image/xa3.jpg'),text:'大唐芙蓉园是首家唐文化主题公园。全球幅宽最大的水幕电影。全国最大的人工雕塑群落。全球最大最先进的水火景观表演。国内最长唐文化长廊。《梦回大唐》大型歌舞品鉴。中国第一个五感（视觉、听觉、嗅觉、触觉、味觉）公园。世界最大的户外香化工程。'},
          {tit:'秦始皇兵马俑',logo:require('../assets/image/xa1.jpg'),text:'兵马俑全称：西安市秦始皇兵马俑博物馆.秦始皇兵马俑博物馆坐落在距西安37千米的临潼县城东，南倚骊山，北临渭水，气势宏伟，是全国重点的文物保护单位。'},
          {tit:'西安华清池',logo:require('../assets/image/xa2.jpg'),text:'盛唐皇家宫苑 中国唐文化旅游标志性景区.华清池，亦名华清宫。东距西安23公里。紧依京畿的地理位置，旖旎秀美的山水风光，自然造化的山地温泉，让周、秦、汉、隋、唐历代帝王皆在此营建离宫别苑，享受天然的旖旎风情。'},
          {tit:'西安大唐芙蓉园',logo:require('../assets/image/xa3.jpg'),text:'大唐芙蓉园是首家唐文化主题公园。全球幅宽最大的水幕电影。全国最大的人工雕塑群落。全球最大最先进的水火景观表演。国内最长唐文化长廊。《梦回大唐》大型歌舞品鉴。中国第一个五感（视觉、听觉、嗅觉、触觉、味觉）公园。世界最大的户外香化工程。'}
        ],
        lj:[
          {tit:'云南丽江古城',logo:require('../assets/image/lj1.jpg'),text:'丽江古城位于中国西南部云南省的丽江市，丽江古城又名大研镇，坐落在丽江坝中部，与同为第二批国家历史文化名城的四川阆中、山西平遥、安徽歙县并称为“保存最为完好的四大古城”大研古城是一座没有城墙的古城'},
          {tit:'丽江泸沽湖',logo:require('../assets/image/lj2.jpg'),text:'泸沽湖位于云南宁蒗县与四川盐源县之间的崇山峻岭中，距宁蒗县城 69 公里。湖面积 52 平方公里，平均水深 45 米，最深处达 93 米。湖水清碧，最大能见度为 12 米。'},
          {tit:'玉龙雪山',logo:require('../assets/image/lj3.jpg'),text:'玉龙雪山是北半球最南的大雪山。山势由北向南走向，南北长35公里，东西宽25公里，雪山面积960平方公里，高山雪域风景位于海拔4000米以上。'},
          {tit:'云南丽江古城',logo:require('../assets/image/lj1.jpg'),text:'丽江古城位于中国西南部云南省的丽江市，丽江古城又名大研镇，坐落在丽江坝中部，与同为第二批国家历史文化名城的四川阆中、山西平遥、安徽歙县并称为“保存最为完好的四大古城”大研古城是一座没有城墙的古城'},
          {tit:'丽江泸沽湖',logo:require('../assets/image/lj2.jpg'),text:'泸沽湖位于云南宁蒗县与四川盐源县之间的崇山峻岭中，距宁蒗县城 69 公里。湖面积 52 平方公里，平均水深 45 米，最深处达 93 米。湖水清碧，最大能见度为 12 米。'},
          {tit:'玉龙雪山',logo:require('../assets/image/lj3.jpg'),text:'玉龙雪山是北半球最南的大雪山。山势由北向南走向，南北长35公里，东西宽25公里，雪山面积960平方公里，高山雪域风景位于海拔4000米以上。'}
        ],
        sh:[
          {tit:'上海迪士尼乐园',logo:require('../assets/image/sh1.jpg'),text:'为什么一定要去上海迪士尼乐园亮点1 ：国内首座迪士尼主题乐园，家门口的世界级家庭娱乐目的地。亮点2 ：拥有全球最大的迪士尼城堡、独有的海岛主题园区、最长的迪士尼花车巡游路线等。亮点3 ：探索别具一格的六大主题园区—米奇大街、奇想花园、梦幻世界、探险岛、宝藏湾和明日世界。'},
          {tit:'上海东方明珠',logo:require('../assets/image/sh2.jpg'),text:'上海东方明珠广播电视塔座落于上海黄浦江畔、浦东陆家嘴嘴尖，以其468米的绝对高度成为亚洲第一、世界第三之高塔。'},
          {tit:'上海外滩',logo:require('../assets/image/sh3.jpg'),text:'外滩（The Bund），位于上海市中心区的黄浦江畔，它是上海的风景线，是到上海观光的游客必到之地。外滩又名中山东一路，全长约1.5公里。东临黄浦江，西面为哥特式、罗马式、巴洛克式、中西合壁式等52幢风格各异的大楼，被称为“万国建筑博览群”。'},
          {tit:'上海迪士尼乐园',logo:require('../assets/image/sh1.jpg'),text:'为什么一定要去上海迪士尼乐园亮点1 ：国内首座迪士尼主题乐园，家门口的世界级家庭娱乐目的地。亮点2 ：拥有全球最大的迪士尼城堡、独有的海岛主题园区、最长的迪士尼花车巡游路线等。亮点3 ：探索别具一格的六大主题园区—米奇大街、奇想花园、梦幻世界、探险岛、宝藏湾和明日世界。'},
          {tit:'上海东方明珠',logo:require('../assets/image/sh2.jpg'),text:'上海东方明珠广播电视塔座落于上海黄浦江畔、浦东陆家嘴嘴尖，以其468米的绝对高度成为亚洲第一、世界第三之高塔。'},
          {tit:'上海外滩',logo:require('../assets/image/sh3.jpg'),text:'外滩（The Bund），位于上海市中心区的黄浦江畔，它是上海的风景线，是到上海观光的游客必到之地。外滩又名中山东一路，全长约1.5公里。东临黄浦江，西面为哥特式、罗马式、巴洛克式、中西合壁式等52幢风格各异的大楼，被称为“万国建筑博览群”。'}
        ],
        rb:[
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'},
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'},
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'},
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'},
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'},
          {tit:'歌舞伎町',logo:require('../assets/image/rb1.jpg'),text:'歌舞伎町是东京唯一的娱乐中心。电影院、电玩舞厅、酒吧等等，从深夜到黎明，人群络绎不绝，是个标准的不夜城。 歌舞伎町位于东京都繁华的新宿区中心地带，分为一丁目和二丁目，即一条和二条。'}
        ],
        xjp:[
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'},
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'},
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'},
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'},
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'},
          {tit:'新加坡环球影城',logo:require('../assets/image/xjp1.jpg'),text:'在这里宛如落入电影的梦幻世界，感受身临其境体验电影的奇妙旅程。他坐落于全球投资额最高、内容最丰富的顶级家庭旅游目的地圣淘沙名胜世界之内。'}
        ],
        bd:[
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '},
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '},
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '},
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '},
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '},
          {tit:'瓦特纳冰川国家公园',logo:require('../assets/image/bd1.jpg'),text:'瓦特纳冰川国家公园（Skaftafell），位于冰岛东南部，是冰岛面积最大的国家公园及自然保护区。该公园集冰川，火山，峡谷，森林，瀑布为一体，景色壮观。 '}
        ],
        medf:[
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'},
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'},
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'},
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'},
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'},
          {tit:'第六感拉姆度假村',logo:require('../assets/image/medf1.jpg'),text:'第六感拉姆度假村由Six Senses Resorts&Spas企业集团经营。该集团在马尔代夫、阿曼、泰国、越南、西班牙和约旦开发经营独特的度假村和Spa项目，旗下品牌包括Soneva、Evason、第六感Spa和第六感目的地Spa。第六感拉姆度假村的品牌价值和个性服务体现了第六感的核心宗旨：打造并启发创意体验，激活人类对慢节奏生活的钟爱。'}
        ],
        tg:[
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'},
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'},
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'},
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'},
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'},
          {tit:'东芭乐园',logo:require('../assets/image/tg1.jpg'),text:'东芭乐园占地1600多亩，是一个泰式乡村风格的休闲兼度假公园，进入其中仿佛进入一个大大的庄园。放眼望去皆是雅致的风景，无论是参观养殖房的奇花异草还是园方精心安排的表演，都充满着乐趣。'}
        ],
        ydl:[
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'},
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'},
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'},
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'},
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'},
          {tit:'阿波罗神殿中心广场',logo:require('../assets/image/ydl1.jpg'),text:'从马利纳门沿坡道而上，首先抵达的是阿波罗神殿中心广场，也称公共广场（Foro），这里曾经是昔日庞贝的政治、经济、宗教中心，广场上的方形会堂（Basilica）还残留着一些砖砌的圆柱底座，此处是以前的法院与商业交易场所。'}
        ],
        ad:[
          {tit:'杭州西湖',logo:require('../assets/image/hz1.jpg'),text:'西湖古称“钱塘湖”，又名“西子湖”，古代诗人苏轼就对它评价道：“欲把西湖比西子，淡妆浓抹总相宜。”西湖形态为近于等轴的多边形，湖面被孤山及苏堤、白堤两条人工堤分割为5个子湖区，子湖区间由桥孔连通，各部分的湖水不能充分掺混，造成各湖区水质差异，大部分径流补给先进入西侧3个子湖区，再进入外西湖；湖水总面积5.593平方公里;，总容积1．10亿立方米，平均水深1．97 米；'},
          {tit:'杭州千岛湖',logo:require('../assets/image/hz2.jpg'),text:'杭州市千岛湖风景名胜区位于中国浙江杭州西效淳安县境内的千岛湖，东距杭州129公里、西距黄山140公里，是长江三角洲地区的后花园，景区内碧水呈奇，千岛百姿 ，自然风光旖旎，生态环境佳绝，因湖内拥有1078座翠岛而得名。千岛湖以千岛、秀水、金腰带 （岛屿与湖水相接处环绕着有一层金黄色的土带，称之名 “金腰带”） 为主要特色景观。千岛湖是中国首批国家级风景名胜区之一，也是中国面积最大的森林公园 ，是“杭州——千岛湖——黄山”名山名水名城黄金旅游线上的一颗璀璨明珠。'},
          {tit:'杭州宋城',logo:require('../assets/image/hz3.jpg'),text:'杭州宋城旅游景区位于西湖风景区西南，北依五云山、南濒钱塘江，是中国最大的宋文化主题公园，由杭州世界城宋城置业有限公司投资兴建。'},
          {tit:'杭州西湖',logo:require('../assets/image/hz1.jpg'),text:'西湖古称“钱塘湖”，又名“西子湖”，古代诗人苏轼就对它评价道：“欲把西湖比西子，淡妆浓抹总相宜。”西湖形态为近于等轴的多边形，湖面被孤山及苏堤、白堤两条人工堤分割为5个子湖区，子湖区间由桥孔连通，各部分的湖水不能充分掺混，造成各湖区水质差异，大部分径流补给先进入西侧3个子湖区，再进入外西湖；湖水总面积5.593平方公里;，总容积1．10亿立方米，平均水深1．97 米；'},
          {tit:'杭州千岛湖',logo:require('../assets/image/hz2.jpg'),text:'杭州市千岛湖风景名胜区位于中国浙江杭州西效淳安县境内的千岛湖，东距杭州129公里、西距黄山140公里，是长江三角洲地区的后花园，景区内碧水呈奇，千岛百姿 ，自然风光旖旎，生态环境佳绝，因湖内拥有1078座翠岛而得名。千岛湖以千岛、秀水、金腰带 （岛屿与湖水相接处环绕着有一层金黄色的土带，称之名 “金腰带”） 为主要特色景观。千岛湖是中国首批国家级风景名胜区之一，也是中国面积最大的森林公园 ，是“杭州——千岛湖——黄山”名山名水名城黄金旅游线上的一颗璀璨明珠。'},
          {tit:'杭州宋城',logo:require('../assets/image/hz3.jpg'),text:'杭州宋城旅游景区位于西湖风景区西南，北依五云山、南濒钱塘江，是中国最大的宋文化主题公园，由杭州世界城宋城置业有限公司投资兴建。'}
        ],
        num:6,
        allLoaded: false,
        bottomStatus: '',
        time:''
      };
    },
    methods: {
      handleBottomChange(status) {
        this.bottomStatus = status;
      },
      loadBottom() {
        clearTimeout(this.time)
        this.time=setTimeout(() => {
          if (this.num < 40) {
            this.num=this.num+6;
            for (let i = 0; i <6; i++) {
              this.ad.push(this.ad[i]);
            }
          } else {
            this.allLoaded = true;
          }
          this.$refs.loadmore.onBottomLoaded();
        }, 1000);
      },
      back(){
        this.$router.go(-1)
      },
      getad(){
        if(this.$route.params.kc[this.$route.params.index].title=="杭州"){
          this.ad=this.hz;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="北京"){
          this.ad=this.bj;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="南京"){
          this.ad=this.nj;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="西安"){
          this.ad=this.xa;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="丽江"){
          this.ad=this.lj;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="上海"){
          this.ad=this.sh;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="日本"){
          this.ad=this.rb;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="新加坡"){
          this.ad=this.xjp;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="冰岛"){
          this.ad=this.bd;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="马尔代夫"){
          this.ad=this.medf;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="泰国"){
          this.ad=this.tg;
        }
        if(this.$route.params.kc[this.$route.params.index].title=="意大利"){
          this.ad=this.ydl;
        }

      }
    },
    mounted(){
      this.getad()
    }
  };
</script>
