<template>
  <div class="new">
    <div class="header2">
      <span><img src="../assets/image/back.png" @click="back"></span>
      <div class="top2">出境游</div>
    </div>
    <img src="../assets/image/jingwai.png" width="100%">
    <div class="page-loadmore">
      <mt-loadmore  :bottom-method="loadBottom" @bottom-status-change="handleBottomChange" :bottom-all-loaded="allLoaded" ref="loadmore">
        <ul class="kc_part">
          <router-link v-for="(aa,index) in kc" :to="{name:'Attractions',params:{kc,index}}">
            <li v-if="index<num"><div style="width: 100px; height: 100px; margin-right: 10px;"><img :src="aa.logo" width="100px"  height="100px"></div><div class="text"><h3>{{aa.title}}</h3><p>{{aa.text}}</p></div></li>
          </router-link>
        </ul>
      </mt-loadmore>
    </div>
  </div>
</template>

<style>
</style>

<script type="text/babel">
  export default {
    data() {
      return {
        kc:[
          {title:'日本',logo:require('../assets/image/riben.jpg'),text:'日本位于亚洲大陆东边的太平洋上。整个国土由四个主要岛屿组成，在这四个岛屿的周围还有约4,000多个小岛，日本的国土面积大致相当于德国和瑞士这两个国家面积的总和，与美国的加利福尼亚州相比要稍微小一点。日本海岸线复杂多变、火山众多，峡谷深邃。境内山地崎岖、河谷交错，山地面积占80%，全国森林覆盖率达66%。地热和渔业资源丰富。日本矿藏资源极为匮乏，绝大部分工业原料和燃料都依赖进口，但它却是世界经济大国，其工业和国民经济生产总值均居世界前列，农业单位面积产量很高。日本是一个地势多变、水力资源丰富的国家，由此构成了优美壮丽的景色，那里有山中积雪的湖泊、怪石嶙峋的峡谷、湍急的河流、峻峭的山峰、雄伟的瀑布以及大大小小的温泉，这些引人入胜的旅游景点常年吸引着大量游客来到日本观光 .'},
          {title:'新加坡',logo:require('../assets/image/xinjiapo.jpg'),text:'新加坡是东南亚的一个岛国，也是一个城市国家。该国位于马来半岛南端，毗邻马六甲海峡南口，其南面有新加坡海峡与印尼相隔，北面有柔佛海峡与马来西亚相隔，并以长堤相连于新马两岸之间。新加坡是亚洲最重要的金融、服务和航运中心之一。新加坡在城市保洁方面效果显著，故亦有“花园城市”之美称。这个面积小的国家对世界上其他国家的人来说，却有着莫大的吸引力。新加坡全年气候温暖，特别适合旅游。新加坡市是著名的花园城市，干净整洁又充满都市气息。圣淘沙岛等就是本着度假圣地的宗旨发展起来的。 新加坡的自然生态保护得如此之好，很难相信在一个现代都市中能环抱中一个天然保护区，并拥有着世界上首个夜间动物园。因此，新加坡每天都吸引着将近12000名来自世界各个国家的旅行者前来旅游观光。'},
          {title:'冰岛',logo:require('../assets/image/bingdao.jpg'),text:'冰岛是欧洲最西部的国家，位于北大西洋中部，靠近北极圈，冰川面积占8000平方公里，为欧洲第二大岛。 全境3/4是海拔 400-800米的高原，其中1/8被冰川覆盖。有100多座火山，其中活火山30多座。华纳达尔斯赫努克火山为全国最高峰，海拔2119米。 冰岛几乎整个国家都建立在火山岩石上，大部分土地不能开垦，是世界温泉最多的国家，地热资源丰富，所以被称为冰火之国。多喷泉、瀑布、湖泊和湍急河流，最大河流锡尤尔骚河长227公里。 冰岛全境遍布国家公园与自然保护区，其中最壮观的是Myvatn自然保护区与Tingvellir、杰古沙龙、史卡法特(Skaftafell)等国家公园。史卡法特国家公园最著名的景点就是史瓦提(Svartifoss)瀑布；杰古沙龙国家公园内的杰古沙龙湖是在冰河底端所形成的一个湖，深达100公尺。'},
          {title:'马尔代夫',logo:require('../assets/image/maerdaifu.jpg'),text:'看过《麦兜故事》的人很难不和麦兜一起爱上这个岛国：“椰林树影，水清沙幼。”马尔代夫的国家旅游局如此评价自己的祖国：“如果你一生中有很多次出国旅游的机会，那你一定要来马尔代夫；如果你一生中只有一次出国旅游的机会，那你更要来马尔代夫。” 马尔代夫位于南亚，是印度洋上的一个岛国，由1200余个小珊瑚岛屿组成，其中202个岛屿有人居住，是亚洲最小的国家。事实上，随着全球的气候变暖， 海平面正以每年两厘米上升。这对于平均海拔只有1.2米的马尔代夫来说是致命的。换言之，以当前海平面的上涨速度，马尔代夫将在50年后完全消失。那么，在这座伊甸园涅槃之前，你是否也要安排一次美丽的邂逅，在马代，和恋人，把浪漫与快乐永远铭刻在内心深处的某个角落？'},
          {title:'泰国',logo:require('../assets/image/taiguo.jpg'),text:'泰国位于亚洲中南半岛中部，东南临泰国湾，西南濒安达曼海。西北与缅甸为邻，西南与马来西亚交接，东北毗连老挝，东南与柬埔寨接壤，总面积513,115平方公里， 人口60,400,000人，是以泰族人为主，生活着华人、缅甸人、马来人、印度人、老挝人等的多民族国家。 泰国以“千佛之国”闻名于世，素有“黄袍佛国 ”美誉，是一个具有两千多年佛教史的文明古国，在美丽富饶的国土上，有30,OOO多座充满神话色彩的古老寺院和金碧辉煌的宫殿。泰国佛寺外观造型宏伟壮观，建筑装饰精巧卓绝，享有“泰国艺术博物馆”美称，是泰国的国宝、泰国文化的精萃。泰国90％的居民信奉佛教，民间艺术丰富多彩，是东南亚首屈一指的旅游大国。 泰国山区森林密布，奇花异木遍布，栖息着众多珍禽异兽。泰国政府把一些天然森林区划为自然保护区，并辟为森林公园。森林中空气清新，是森林浴的佳地。这里气候四季皆春，又有瀑布、湖泊和各种飞禽走兽，吸引了一批批旅游者慕名而来。 首都曼谷被誉为“天使之城”，是古典与现代的完美结合。既有高耸矗立的大型建筑，强调着城市奇情与超越时空的景致，又有古老的庙宇香火鼎盛，青烟缭绕，具有浓厚的东方色彩；既有家一样的温馨暖意，同时又充满异域情调，神秘与探险俯拾即是。 与首都曼谷不同，作为兰纳王国的故都，清迈则无不散发着迷人的古典气质。这里气候凉爽，四季百花争艳，被称为“泰北玫瑰”。在清迈，要慢下来细细品味你的感官所能接触到的一切。悠然穿行在清迈古城花木扶疏的小巷中，随意在古城中闲逛，不用装，自然而然便化身为文艺青年一枚。 值得一提的是，清迈是华语歌后邓丽君的一生挚爱，她也最终将生命交托于此。晚年的歌后曾不幸罹患气喘病，身体完全不允许接触存在花粉的环境。然而歌后对清迈的痴情却始终不渝，她不仅爱这座城的花，这座城的人，更爱这座城能给她带来的淡然与恬静。'},
          {title:'意大利',logo:require('../assets/image/yidali.jpg'),text:'意大利位于欧洲南部，主要由靴子型的亚平宁半岛和两个位于地中海中的大岛西西里岛和萨丁岛组成。其领土包围着两个袖珍国——圣马力诺和梵蒂冈。 意大利因其拥有美丽的自然风光和为数众多的人类文化遗产而被称为美丽的国度。意大利是世界上高度发达国家之一，是北大西洋公约和欧盟的创始会员国之一。 作为地中海沿岸的一个半岛国家，意大利的国土有大陆、半岛以及零散岛屿三种组成。意大利南北风光绝然不同，北部的阿尔卑斯山区终年积雪、风姿绰约，南部的西西里岛阳光充足而又清爽宜人。一年四季，意大利的任何角落，都不会令人失望。'}
        ],
        num:6,
        allLoaded: false,
        bottomStatus: '',
        time:''
      };
    },
    methods: {
      handleBottomChange(status) {
        this.bottomStatus = status;
      },
      loadBottom() {
        clearTimeout(this.time)
        this.time=setTimeout(() => {
          if (this.num < 40) {
            this.num=this.num+6;
            for (let i = 0; i <6; i++) {
              this.kc.push(this.kc[i]);
            }
          } else {
            this.allLoaded = true;
          }
          this.$refs.loadmore.onBottomLoaded();
        }, 1000);
      },
      back(){
        this.$router.go(-1)
      }
    }
  };
</script>
