<template>
  <div class="new">
    <div class="header2">
      <span><img src="../assets/image/back.png" @click="back"></span>
      <div class="top2">旅游指南</div>
    </div>
    <div class="titzhinan"><div class="greendiv"></div>最新旅游指南</div>
    <div class="page-loadmore">
      <mt-loadmore  :bottom-method="loadBottom" @bottom-status-change="handleBottomChange" :bottom-all-loaded="allLoaded" ref="loadmore">
        <ul class="kc_part">
          <router-link v-for="(aa,index) in kc" :to="{name:'Article',params:{kc,index}}">
            <li v-if="index<num"><p class="gongluep">{{aa.tit}}</p></li>
          </router-link>
        </ul>
      </mt-loadmore>
    </div>
  </div>
</template>

<style>
</style>

<script type="text/babel">
  export default {
    data() {
      return {
        kc:[
          {tit:' 呼伦贝尔五日游行程怎么安排 ',text:'&nbsp&nbsp&nbsp&nbsp第一天去海拉尔，先到酒店办理入住。下午在市区游览，可以去西山公园、伊敏河畔。第二日去呼伦贝尔草原，享受蓝天白云和绿草。参加一些草原活动，品尝当地美食。第三日建议去额尔古纳湿地，欣赏其巧夺天工的美。下午前往莫尔道嘎，欣赏沿途的白桦林。第四日去老鹰嘴。<br/>&nbsp&nbsp&nbsp&nbsp哈乌尔河从中流过，形成第一无二的风景。下午去临江屯，体验华俄后裔生活。第五日上午准备行李，下午返程。首先为游客推荐的是满洲里威尼斯大酒店。这家酒店的房型多种多样，游客可选择性很多，周边有步行街，吃饭购物很便利。其次推荐的是呼伦贝尔恩和牧场国际青年旅舍。在房间内就能看到草原，白天夜晚的景色都很漂亮，这家青旅整体都散发着一种惬意的情调。<br/>&nbsp&nbsp&nbsp&nbsp最后推荐的是呼伦贝尔德盛大酒店。地处繁华地段，吃喝玩乐都方便，价格便宜，性价比高。首先推荐的是卢布里西餐厅。这家西餐厅是俄式餐饮，这家的招牌菜：格瓦斯、卢布里乳酪包等都是非常好吃的。其次推荐的是诺敏塔拉奶茶。到这家店必吃的是锅茶，味道很好，内蒙古特色。这家店的蒙古果子还有面包、拔丝奶皮都很赞。最后推荐的是蒙祥原烤肉。羊肉的肉质很好，这也是一家连锁烤肉店。小料丰富，味道适中，价格实惠。'},
          {tit:' 呼伦贝尔四日游行程怎么安排？ ',text:'&nbsp&nbsp&nbsp&nbsp呼伦贝尔的景点很多，最著名的就是辽阔的大草原。第一天推荐游客们去大草原，这里仍有很多本地人保持着放牧的习性。第二天推荐游客们前往额尔古纳，来到这里必去就是当地的湿地。这里栖居着很多飞禽，游客们可以登到山顶俯瞰景观。第三天推荐游客们去莫尔格勒河，河水以一种奇特的弯曲形状向前流动。第四天推荐游客们去呼伦湖，湖泊面积很大，游客们可以在此地游玩半天时间。呼伦贝尔虽是典型的草原景观，但其建筑同样带有现代特色。<br/>&nbsp&nbsp&nbsp&nbsp首先向游客们推荐的酒店是满洲里威尼斯，这家酒店的建筑极具欧洲格调。房间布置的很温馨，卧具柔软舒适，条件不错。它的地理位置很好，距离当地的市中心较近。其次向游客们推荐的酒店是海拉尔，酒店房间打扫的很干净整洁，酒店员工们的态度热情，性价比总体较高。酒店距离当地的景点也很近，方便游玩。'},
          {tit:'甘肃的莫高窟门票价格多少？ ',text:'&nbsp&nbsp&nbsp&nbsp甘肃的莫高窟有什么好玩的地方_甘肃的莫高窟开放时间是什么时候？<br/>&nbsp&nbsp&nbsp&nbsp莫高窟属全国重点文物保护单位，俗称千佛洞，被誉为20世纪最有价值的文化发现、“东方卢浮宫”，坐落在河西走廊西端的敦煌，以精美的壁画和塑像闻名于世。莫高窟由敦煌莫高窟数字展示中心和莫高窟实体洞窟两部分组成。前往实体窟之前可在数字展示中心内观赏主题数字电影《千年莫高》和球幕电影《梦幻佛宫》，两部电影分别介绍了莫高窟的千年历史，让观众如临窟内。'},
          {tit:'张掖丹霞地质公园玩什么？',text:'&nbsp&nbsp&nbsp&nbsp张掖丹霞地质公园需要买门票吗_张掖丹霞地质公园在什么地方？<br/>张掖丹霞地质公园分为临泽县入口和肃南县入口两个入口，西入口在临泽县倪家营南台子村，是中国丹霞地貌发育最大最好、地貌造型最丰富的地区之一。张掖丹霞景区还是张艺谋的电影《三枪拍案惊奇》、姜文执导的电影《太阳照常升起》、知名电视剧《神探狄仁杰》的外景地。<br/>&nbsp&nbsp&nbsp&nbsp张掖丹霞主要由红色砾石、砂岩和泥岩组成，游客在景区内能看到数以千计的悬崖、山峦呈现出鲜艳的丹红色和红褐色，特别是在阳光的照耀下，各处造型奇特的山地丘陵色彩斑斓、气势磅礴。 这里是摄影爱好者的天堂，在景区内有不少摄影者扛着“长枪大炮”四处拍摄取景。2005年11月由中国地理杂志社与全国34家媒体联合举办的“中国最美的地方”评选活动中，当选为“中国最美的七大丹霞”之—。'},
          {tit:' 甘肃的月牙泉在什么地方？',text:'&nbsp&nbsp&nbsp&nbsp甘肃的月牙泉门票价格多少_甘肃的月牙泉要怎么去？月牙泉位于甘肃省敦煌市城南5公里的鸣沙山北麓。古往今来以“山泉共处，沙水共生”的奇妙景观著称于世，被誉为“塞外风光之一绝”，1994年被定为国家重点风景名胜区。<br/>&nbsp&nbsp&nbsp&nbsp月牙泉位于鸣沙山北麓，处于鸣沙山环抱之中，东西长300余米，南北宽50余米，水深约5米，泉形酷似一弯新月，故名月牙泉。古称“沙井”，又名“药泉”，一度讹传“渥洼池”，清代正名“月牙泉”。面积0.88公顷，平均水深3米左右，水质甘冽，清澈如镜。泉被鸣沙山四面环抱，但并不为流沙所掩，始终碧波荡漾，清澈见底，久雨不溢，久旱不涸，泉内星草含芒、铁鱼鼓浪，山色水光相映成趣，风光十分优美。它的神奇之处就是流沙永远填埋不住清泉。'},
          {tit:' 怎么抵达雅丹国家地质公园？ ',text:'&nbsp&nbsp&nbsp&nbsp雅丹国家地质公园门票价格_雅丹国家地质公园地理位置在哪里？<br/>&nbsp&nbsp&nbsp&nbsp雅丹国家地质公园也叫雅丹魔鬼城，位于敦煌市西北约108km处，玉门关西北约100km处。雅丹满地有如“石头巧克力糖”一般的磁石，指南针在此不起作用。“雅丹”地貌是一种典型的风蚀性地貌，其壮丽、雄浑、怪异和神奇，不亲临其境，是无法领略的。公园内集中连片地分布着各种各样造型奇特的风蚀地貌，例如，“蒙古包”、“骆驼”、“石鸟”、“石人”、“石佛”、“石马”等，千姿百态，惟妙惟肖。它宛如一座中世纪的古城，世界许多著名的建筑都可以在这里找到它的缩影，令世人瞠目。夜幕降临之后，尖厉的劲风发出恐怖的啸叫，犹如千万只野兽在怒吼，令人毛骨悚然，也因此得名“魔鬼城”。'},
          {tit:' 甘肃的嘉峪关城门票价格？ ',text:'&nbsp&nbsp&nbsp&nbsp如何到达甘肃的嘉峪关城门_甘肃的嘉峪关城门有什么好玩的？<br/>&nbsp&nbsp&nbsp&nbsp--嘉峪关关城是明长城西端的第一重关，也是古代“丝绸之路”的交通要塞。关城始建于明朝，是万里长城沿线最为壮观的关城。<br/>&nbsp&nbsp&nbsp&nbsp--这里并不仅是单独的关隘，分为内城、外城和城壕。外城的雄关水寨可以远摄关城外景，进入内城登上城楼，祁连山麓在远方连绵。<br/>&nbsp&nbsp&nbsp&nbsp--景区内还有很多小摊，有古装合影，卖书法卖字画等，可以一一参观。景区内的长城博物馆更能了解到雄关历史，不可错过。'},
          {tit:' 呼伦贝尔适合老人玩的地方 ',text:'&nbsp&nbsp&nbsp&nbsp呼伦贝尔适合老人玩的地方 呼伦贝尔不仅自然景色非常的优美，而且当地的景点也是比较多的，像满洲里市区里面的套娃广场，就非常适合带老年人去进行游玩，套娃广场是休闲娱乐的广场，由于老年人的体力不是很好，到这里游玩，没有必要走太长的时间。而且在套娃广场里面还有很多俄罗斯风味的餐厅，另外还有很多的商场。运气好的朋友在游玩的过程当中，还能碰到一些俄罗斯盛装巡游表演，景区免费开放。<br/>&nbsp&nbsp&nbsp&nbsp呼伦贝尔适合老人的景点 呼伦贝尔民族博物馆也是比较适合带老年人游玩的，这里的建筑物都是传统的中国风格建筑，而且还能看到很多的文物，很好地展示了当地的一些历史和民族文化。相信老年人对于这些民族文化，还有历史和文物都是比较感兴趣的，另外在博物馆里面还有北方游牧民族摇篮，等一些主题的展览可以参观。其次，这里展出的文物还包括了秦汉时期的一些青铜铸造的短剑等，门票价40元。'},
          {tit:' 呼伦贝尔适合孩子的游乐场  ',text:'&nbsp&nbsp&nbsp&nbsp呼伦贝尔适合孩子的游乐场 呼伦贝尔这里适合孩子的游乐场首先要推荐的就是中俄蒙国际冰雪乐园，这是一和超大型的室内冰雪游乐园，这个游乐园当中的游玩项目很多，有适合大人的滑冰类的项目，也有专门为孩子打造的游玩项目，比如说冰滑梯等，这些游玩项目和一般的游乐园当中的游玩项目是完全不一样的，可以给孩子带来特别的游玩体验，除此之外，在游乐园当中还可以欣赏到美丽的冰雕，包括中国的，也包括俄罗斯风情和蒙元风情的，非常有趣。这个游乐场在海拉尔区中俄蒙文化创业产业园当中，门票是278元。<br/>&nbsp&nbsp&nbsp&nbsp呼伦贝尔适合小孩子玩的游乐场 在呼伦贝尔，比较适合孩子游玩的游乐场还有满洲里北湖公园游乐园，这个游乐园是建立在公园当中，公园的景色美丽，空气也很清新，孩子们在这里游玩的同时也可以呼吸到新鲜的空气。现在的游乐园当中的游玩项目已经非常多了，游乐设备也都非常先进，像云霄飞车、旋转木马等都是孩子们非常喜欢的，让孩子在开心玩乐的同时也可以锻炼自己的行动能力和想象力。这个游乐园是按项目收费的。'},
          {tit:' 宋城烂苹果乐园好玩吗，宋城烂苹果乐园门票多少钱？ ',text:'&nbsp&nbsp&nbsp&nbsp宋城烂苹果乐园好玩吗，宋城烂苹果乐园门票多少钱？<br/>&nbsp&nbsp&nbsp&nbsp这里既有大型高科技互动游乐：XD虚拟过山车、环境4D影院、海底两亿年等，又有亲情版的海马舞会、水槽光缆车、逍遥水母、魔法小火车等项目，还有DIY系列的活动：巧克力DIY、蛋糕DIY等等。烂苹果大剧场、猴子学院、苹果树舞台、爱的故事屋等场馆都将上演一场场精彩的表演！'},
          {tit:' 呼伦贝尔四日游行程怎么安排？ ',text:'&nbsp&nbsp&nbsp&nbsp呼伦贝尔的景点很多，最著名的就是辽阔的大草原。第一天推荐游客们去大草原，这里仍有很多本地人保持着放牧的习性。第二天推荐游客们前往额尔古纳，来到这里必去就是当地的湿地。这里栖居着很多飞禽，游客们可以登到山顶俯瞰景观。第三天推荐游客们去莫尔格勒河，河水以一种奇特的弯曲形状向前流动。第四天推荐游客们去呼伦湖，湖泊面积很大，游客们可以在此地游玩半天时间。呼伦贝尔虽是典型的草原景观，但其建筑同样带有现代特色。<br/>&nbsp&nbsp&nbsp&nbsp首先向游客们推荐的酒店是满洲里威尼斯，这家酒店的建筑极具欧洲格调。房间布置的很温馨，卧具柔软舒适，条件不错。它的地理位置很好，距离当地的市中心较近。其次向游客们推荐的酒店是海拉尔，酒店房间打扫的很干净整洁，酒店员工们的态度热情，性价比总体较高。酒店距离当地的景点也很近，方便游玩。'},
          {tit:'甘肃的莫高窟门票价格多少？ ',text:'&nbsp&nbsp&nbsp&nbsp甘肃的莫高窟有什么好玩的地方_甘肃的莫高窟开放时间是什么时候？<br/>&nbsp&nbsp&nbsp&nbsp莫高窟属全国重点文物保护单位，俗称千佛洞，被誉为20世纪最有价值的文化发现、“东方卢浮宫”，坐落在河西走廊西端的敦煌，以精美的壁画和塑像闻名于世。莫高窟由敦煌莫高窟数字展示中心和莫高窟实体洞窟两部分组成。前往实体窟之前可在数字展示中心内观赏主题数字电影《千年莫高》和球幕电影《梦幻佛宫》，两部电影分别介绍了莫高窟的千年历史，让观众如临窟内。'},
          {tit:'张掖丹霞地质公园玩什么？',text:'&nbsp&nbsp&nbsp&nbsp张掖丹霞地质公园需要买门票吗_张掖丹霞地质公园在什么地方？<br/>&nbsp&nbsp&nbsp&nbsp张掖丹霞地质公园分为临泽县入口和肃南县入口两个入口，西入口在临泽县倪家营南台子村，是中国丹霞地貌发育最大最好、地貌造型最丰富的地区之一。张掖丹霞景区还是张艺谋的电影《三枪拍案惊奇》、姜文执导的电影《太阳照常升起》、知名电视剧《神探狄仁杰》的外景地。<br/>&nbsp&nbsp&nbsp&nbsp张掖丹霞主要由红色砾石、砂岩和泥岩组成，游客在景区内能看到数以千计的悬崖、山峦呈现出鲜艳的丹红色和红褐色，特别是在阳光的照耀下，各处造型奇特的山地丘陵色彩斑斓、气势磅礴。 这里是摄影爱好者的天堂，在景区内有不少摄影者扛着“长枪大炮”四处拍摄取景。2005年11月由中国地理杂志社与全国34家媒体联合举办的“中国最美的地方”评选活动中，当选为“中国最美的七大丹霞”之—。'},
          {tit:' 怎么抵达雅丹国家地质公园？ ',text:'&nbsp&nbsp&nbsp&nbsp雅丹国家地质公园门票价格_雅丹国家地质公园地理位置在哪里？<br/>&nbsp&nbsp&nbsp&nbsp雅丹国家地质公园也叫雅丹魔鬼城，位于敦煌市西北约108km处，玉门关西北约100km处。雅丹满地有如“石头巧克力糖”一般的磁石，指南针在此不起作用。“雅丹”地貌是一种典型的风蚀性地貌，其壮丽、雄浑、怪异和神奇，不亲临其境，是无法领略的。公园内集中连片地分布着各种各样造型奇特的风蚀地貌，例如，“蒙古包”、“骆驼”、“石鸟”、“石人”、“石佛”、“石马”等，千姿百态，惟妙惟肖。它宛如一座中世纪的古城，世界许多著名的建筑都可以在这里找到它的缩影，令世人瞠目。夜幕降临之后，尖厉的劲风发出恐怖的啸叫，犹如千万只野兽在怒吼，令人毛骨悚然，也因此得名“魔鬼城”。'}

        ],
        num:14,
        allLoaded: false,
        bottomStatus: '',
        time:''
      };
    },
    methods: {
      handleBottomChange(status) {
        this.bottomStatus = status;
      },
      loadBottom() {
        clearTimeout(this.time)
        this.time=setTimeout(() => {
          if (this.num < 1000) {
            this.num=this.num+14;
            for (let i = 0; i <14; i++) {
              this.kc.push(this.kc[i]);
            }
          } else {
            this.allLoaded = true;
          }
          this.$refs.loadmore.onBottomLoaded();
        }, 1000);
      },
      back(){
        this.$router.go(-1)
      }
    }
  };
</script>
