<template>
  <div class="new">
    <div class="header2">
      <span><img src="../assets/image/back.png" @click="back"></span>
      <div class="top2">旅游咨询</div>
    </div>
    <mt-swipe :auto="4000">
      <mt-swipe-item> <router-link :to="{name:'Article',params:{kc,index:0}}"><img src="../assets/image/zixun1.jpg"></router-link></mt-swipe-item>
      <mt-swipe-item><router-link :to="{name:'Article',params:{kc,index:2}}"><img src="../assets/image/zixun2.jpg"></router-link></mt-swipe-item>
      <mt-swipe-item> <router-link :to="{name:'Article2',params:{kc2,index:3}}"><img src="../assets/image/zixun3.png"></router-link></mt-swipe-item>
    </mt-swipe>
    <div class="titzhinan"><div class="greendiv"></div>国内资讯</div>
    <div class="page-loadmore">

        <ul class="kc_part">
          <router-link v-for="(aa,index) in kc" :to="{name:'Article',params:{kc,index}}">
            <li v-if="index<num"><p class="gongluep">{{aa.tit}}</p></li>
          </router-link>
        </ul>
    </div>
    <div class="titzhinan"><div class="greendiv"></div>出境咨询</div>
    <div class="page-loadmore">
        <ul class="kc_part">
          <router-link v-for="(aa,index) in kc2" :to="{name:'Article2',params:{kc2,index}}">
            <li v-if="index<num"><p class="gongluep">{{aa.tit}}</p></li>
          </router-link>
        </ul>
    </div>
  </div>
</template>

<style>
</style>

<script type="text/babel">
  export default {
    data() {
      return {
        kc:[
          {tit:'搭建合作交流平台 推动澳门旅游升级',text:'&nbsp&nbsp&nbsp&nbsp近日，伴随着第六届世界旅游经济论坛即将在澳门如期举行，作为世界旅游休闲中心——澳门将再次赢得瞩目。<br/>&nbsp&nbsp&nbsp&nbsp今年七一，习近平总书记在会见澳门特别行政区行政长官崔世安时强调，澳门在落实“一国两制”方针、稳健施政和维护国家安全等方面，做了大量积极有效的工作。当前，澳门总体形势是好的，各项工作取得了新的进步。希望澳门积极推进经济适度多元发展，维护社会大局稳定，以务实稳健的施政巩固澳门良好局面。<br/>&nbsp&nbsp&nbsp&nbsp近年来，促进澳门世界旅游休闲中心建设联合工作委员会（以下简称“联委会”）通过多种措施，积极推动中央惠澳政策落实，深化区域旅游合作，加强新产品开发，联合宣传推广，进一步推动了澳门旅游业的繁荣发展。'},
          {tit:'张家界成为"国家森林城市":推窗见景 出门见绿 游憩见园',text:'&nbsp&nbsp&nbsp&nbsp10月10日上午，在2017年全国森林城市座谈会上，张家界市等19个城市被授予“国家森林城市”，成为我省今年唯一获此殊荣的城市。<br/>&nbsp&nbsp&nbsp&nbsp早在2003年，张家界市就提出创建国家森林城市的工作目标。2014年，张家界市出台加快创建国家森林城市的决定，从“建设国内外知名旅游胜地”“生态文明示范区”的战略高度，按照“城乡一体、整体推进、突出重点、科学绿化”的总体思路和“城区森林进城、近郊森林围城、农村兴林富民”的战略布局，以沿城、沿景、沿水、沿路等“四沿”重点，实施“创森”九大工程建设，打造了一批普惠的民生工程、民心工程，让市民“推窗见景，出门见绿，游憩见园”，市民的幸福指数和获得感不断提升。'},
          {tit:'国庆中秋长假期间 重庆有5.8万余人次出境游',text:'&nbsp&nbsp&nbsp&nbsp国庆中秋长假，重庆市民最爱去哪儿旅游？10日，记者从重庆市公安局出入境管理局获悉，9月30日至10月8日期间，我市市民出境人数达5.8万余人次，同比增幅18.38%，中国香港排在出境游目的地首位。<br/>&nbsp&nbsp&nbsp&nbsp据了解，重庆市民的出境时间主要集中在10月1日至3日，出境人数均超8000人。其中，10月2日当天出境人数最多，为8948人。与之相比，去年国庆期间市民出境人数超过8000人的仅10月1日这一天。入境时间主要集中在10月5日至7日，其中10月6日当天入境人数最多，达9500余人次。<br/>&nbsp&nbsp&nbsp&nbsp从出境年龄分布来看，作为上班族的70后、80后、90后是主力，分别占到出境市民人数的15.77%、30.42%、22.4%。与去年同期相比，90后的出境占比明显增长，较去年同期上涨3个百分点。'},
          {tit:'三亚国际化旅游发展监测体系上线 推动旅游大数据建设',text:'&nbsp&nbsp&nbsp&nbsp如何迅速了解三亚旅游的国际竞争优势、劣势？10月10日，三亚日报记者从市旅游委获悉，三亚着力推进的“旅游+互联网”项目又有新成果，三亚国际化旅游发展监测体系正式上线“数说三亚”，市民游客可在三亚市民游客中心的数字大屏一览旅游信息化研究成果、数据分析，全方位了解鹿城旅游国际竞争环境等多项指标，有力推动三亚旅游大数据建设水平。<br/>&nbsp&nbsp&nbsp&nbsp据了解，由三亚市旅游委策划指导、三亚市旅游协会具体运营的国际化旅游发展监测体系已连续发布三期月度报告及一期季度报告。报告选取11个国际知名热带滨海旅游目的地的主要旅游运营参数与三亚进行对比分析，为三亚国际化旅游发展提供了实时科学的数据支持。为使广大游客能够直观生动地了解和感受监测体系的相关成果，三亚市信投公司利用数据可视化技术，在市民游客中心“数说三亚”数字大屏成功上线国际化旅游发展监测体系成果。具体而言，监测体系数字屏幕分为两个部分，天幕部分展示监测体系报告中目的地关键运营指标，包括星级酒店均价、千公里国际航班价格、目的地消费者价格指数、国际游客航空到港量、大型活动及会展活动数量、目的地知名度等，方便游客清晰明了地了解三亚与国际竞争目的地的优劣势；地幕部分展示三亚当月的国际航班线路，体现三亚国际旅游市场的拓展情况。<br/>&nbsp&nbsp&nbsp&nbsp据悉，三亚信投公司还将在“数说三亚”电子大屏上定期更新旅游信息化相关监测成果，推动三亚旅游大数据建设，加快三亚建设世界级滨海旅游城市进程。'},
          {tit:'三亚旅游入选旅游行业榜单15强 迎来发展新契机',text:'&nbsp&nbsp&nbsp&nbsp近日，全球最大的社交媒体Facebook与毕马威咨询公司（KPMG）联合发布“2017中国出海人本营销领先品牌排行榜”，三亚旅游凭借在海外营销推广的优异表现成功入选旅游行业榜单15强。<br/>&nbsp&nbsp&nbsp&nbsp该排行榜综合评估了中国企业或机构在全球主要市场的品牌知名度以及通过Facebook数据所表现的品牌影响力。随着“一带一路”倡议的推出，三亚旅游出海迎来发展新契机，三亚市旅游发展委员会积极构建的12大海外新媒体平台矩阵，帮助各旅游品牌实现轻松“出海”，将新媒体全球整合营销项目的效果最大化，同时帮助三亚各企业提升海外品牌露出，共同打造三亚“多元化”“精品化”的旅游体验，落实整合商旅资源，有机结合三亚旅游目的地宣传，实现战略共赢。<br/>&nbsp&nbsp&nbsp&nbsp三亚旅游深耕跨境市场多年，在新的发展形势下，不断强化旅游与新媒体的融合发展，通过利用不同平台和渠道的特性，量身定制专属于三亚旅游的新媒体整合营销方案，以自身敏锐的热点洞察力及强有力的资源整合能力，整体提升了三亚旅游品牌及产品的影响力，在国际舞台崭露头角。由此进入全球视野，荣获2017中国出海人本营销领先品牌排行榜旅游行业榜单15强。'},
          {tit:'文昌全域旅游优质资源发布之夜 推介16个重点景点',text:'&nbsp&nbsp&nbsp&nbsp10月10日晚20时，最美椰乡是文昌——文昌市喜迎十九大暨全域旅游优质资源发布之夜在高隆湾晋唐海湾沙滩举行。活动现场推介文昌全域旅游优质资源，展示了东郊椰林、文昌航天发射场、高隆湾航天渔人码头海鲜广场、八门湾海上森林公园、铜鼓岭国家生态景区等文昌全域旅游的16个重点景点。<br/>&nbsp&nbsp&nbsp&nbsp文昌市委书记刘登山在发布之夜活动上致辞。他说，文昌是一个民风淳朴、物华天宝、人杰地灵的地方，文化底蕴深厚，生态良好，森林覆盖率达58%，椰树遍布全市，素有“海南椰子半文昌”的美誉。文昌旅游资源十分丰富，景区景点众多。特别是文昌航天发射场自2016年6月25日成功发射长征七号运载火箭以来，吸引着全国各地游客到文昌旅游观光，并带动了一批大企业到文昌考察交流、投资兴业。<br/>&nbsp&nbsp&nbsp&nbsp刘登山说，文昌大力发展全域旅游，策划特色旅游线路，实现电子地图和城乡公路统一编号，完善全域旅游交通体系和旅游导览功能，正在建设六大特色产业小镇、“南海时光隧道”和滨海美丽乡村走廊，打造国家生态海岸公园和环八门湾湿地公园。真诚欢迎大家来文昌喝最甜的椰子水，吃最美味的文昌鸡，看最美的椰林，逛最壮观的航天发射场，共享文昌旅游发展的大好机遇，共创文昌旅游的美好前景。'},
          {tit:'遂川入围全国“观鸟绝胜十佳”榜单',text:'&nbsp&nbsp&nbsp&nbsp近日，2017中国候鸟旅居小城榜在深圳文博会发布。遂川县入围“观鸟绝胜十佳”榜单，全国共20个县（市）入围。<br/>&nbsp&nbsp&nbsp&nbsp2017中国候鸟旅居小城榜活动以“候鸟旅居·健康中国”为主题。活动旨在全力推进“观光旅游”转型升级为“健康旅居”新业态，并倡导实施乡村旅居扶贫、健康食品扶贫、候鸟智库扶贫、森林康养扶贫和生态治理扶贫五大产业扶贫模式。<br/>&nbsp&nbsp&nbsp&nbsp遂川千年鸟道在全国乃至世界都享有极高的知名度。每年9月天气转凉，“遂川千年鸟道”就会迎来百万候鸟迁徙大军。该县林业局每年都会专题部署候鸟保护工作，为候鸟迁徙保驾护航。'},
          {tit:'2017年南通“十一”、“中秋”旅游情况综述',text:'&nbsp&nbsp&nbsp&nbsp按照省旅游局和市委、市政府关于黄金周假期工作的部署，我市各相关部门、县（市）区加强组织领导，落实责任分工，密切协作配合，狠抓贯彻落实，实现了黄金周假期旅游安全顺利，市场规范有序，服务质量显著提升，综合效益再创佳绩的总目标。<br/>&nbsp&nbsp&nbsp&nbsp今年黄金假期“十一”、“中秋”双节同庆，2017年中国南通江海国际旅游节同步拉开序幕，进一步推介了江海旅游，弘扬了江海文化，拉动以国庆、中秋为热点的秋季旅游市场。假日期间南通市传统景区与新业态产品齐头并进，较好地实现了旅游市场安全、秩序、质量、效益“四统一”的目标。8天长假，前3天持续阴雨，后5天逐渐放晴，气温回升。全市纳入统计的10家景区共接待138.98万人次，同比增长1.67%，收入2572.49万元，同比增长0.52%。<br/>&nbsp&nbsp&nbsp&nbsp节假日期间，全市旅游市场运行安全、平稳、健康、有序，没有接到旅游安全事故报告。市旅游局旅游投诉中心共接到投诉电话6个，涉及旅行社的3件，投诉景区的3件，上述有效投诉均已及时妥善处理。'}

        ],
        kc2:[
          {tit:'美媒称中国人出门只需带手机：从爱用钞票转变为扫码支付',text:'&nbsp&nbsp&nbsp&nbsp　　美媒称，手机支付正风靡中国，并改变着日常商务。　　据美国消费者新闻与商业频道网站10月8日报道，与四年前相比，最大的变化就是中国社会从使用钞票转变为到处扫描二维码支付。<br/>&nbsp&nbsp&nbsp&nbsp　　报道称，与朋友外出用餐或购物时，人们通过扫描餐桌上的二维码或者向店员出示其智能手机上的类似条码来付款。调味品店、博物馆的纪念品店，以及卖毛笔的店铺都有标牌，称接受手机支付。　　人们的问题常常是“你是用支付宝还是微信？”而不是“你用信用卡吗？”有个很流行的笑话说，中国大街上的乞讨者更愿意接受手机支付，而不是现金。 <br/>&nbsp&nbsp&nbsp&nbsp　　据高瓴资本集团在5月份的报告中所引用的数据，2016年，中国的手机支付额翻了一番以上，达5万亿美元。研究显示，今年第一季度，支付宝占据了手机支付市场54%的份额，而微信支付则占到40%。　　报道称，中国人的手机支付习惯也影响着其他国家。据新华社报道，在今年国庆黄金周期间，中国内地出境游人数超过600万人次。这令日本和香港等受欢迎的旅游目的地备感压力，它们感到必须加强手机支付服务。'},
          {tit:'中国赴印尼游客人数飙升 或重塑巴厘岛旅游业',text:'&nbsp&nbsp&nbsp&nbsp　　港媒称，当埃尔西·德林纳第一次搬到巴厘岛当导游时，她注意到，这个印度尼西亚小岛上的游客往往来自香港、台湾及亚洲其他地区。但从2010年开始，来自中国大陆的游客人数首次超过台湾地区。从那时起，中国内地游客人数迅速增长，在4年内翻了一番，两年后又翻了一番。<br/>&nbsp&nbsp&nbsp&nbsp　　据香港《南华早报》网站10月8日报道，现在，德林纳有了自己的旅行社，而中国游客是她生意上的主力军。　　“较早前，人们很少离开中国。但是在过去5年里，增长非常显著。”她说。<br/>&nbsp&nbsp&nbsp&nbsp　　报道称，中国人正在重塑巴厘岛的旅游业，而这个行当占据该岛经济的80%左右。'},
          {tit:'巴基斯坦：安全形势改善　考虑向16个国家开放落地',text:'&nbsp&nbsp&nbsp&nbsp　　巴基斯坦的年入境游客数从2013年至2016年已提升三倍，至175万人次；期间巴基斯坦的本国游客数也有30%的上涨，达3830万人次。<br/>&nbsp&nbsp&nbsp&nbsp　　提到巴基斯坦这个国家，人们通常会不自觉地把它与爆炸、恐怖袭击所联系起来。去这个国家出差可能还会担心要不要额外买份人身保险，更别说去旅游了。<br/>&nbsp&nbsp&nbsp&nbsp　　但是随着巴基斯坦国内安全形势逐渐改善，越来越多的游客已经开始去探索这个南亚次大陆的古老国度了。根据巴基斯坦政府机构巴基斯坦旅游发展公司（Pakistan Tourism Development Corp）数据显示，巴基斯坦的年入境游客数从2013年至2016年已提升三倍，至175万人次；期间巴基斯坦的本国游客数也有30%的上涨，达3830万人次。'},
          {tit:'韩旅游收支逆差创新高　中国游客“黄金周”转向东南亚',text:'&nbsp&nbsp&nbsp&nbsp　　韩国政府执意部署“萨德”，让中韩关系持续遇冷，中国游客赴韩热情锐减。据韩国旅游发展局最新数据显示，韩国旅游收支逆差创新高，韩媒感叹，中国游客减少是主因。<br/>&nbsp&nbsp&nbsp&nbsp　　据韩联社8日报道，今年以来，赴韩外国游客人数不断减少，出境旅游的韩国人数则同比大增，韩国旅游收支逆差不断扩大，甚至创历史新高。<br/>&nbsp&nbsp&nbsp&nbsp　　韩国旅游发展局8日发布的一份数据显示，今年1-8月，赴韩外国游客人数为886.4182万人次，同比锐减22.8%。同期，韩国出境旅游人次同比增长17.7%，达1739.551万人次，出境游人次相当于入境游的1.96倍左右。'},
          {tit:'国庆8天长假赴韩中国团体游客数量为零',text:'&nbsp&nbsp&nbsp&nbsp中国国庆中秋黄金周8天长假已经过去，韩媒称，在“萨德”影响下，中国团体游客数量仍然为零，免税店销售额不可避免地出现了下滑。10月1-7日，中国顾客在乐天免税店的购物额较去年国庆假期减少了25%。尽管乐天免税店开展了不少针对本国顾客的折扣活动，但这期间的整体销售额仍较去年减少了15%。<br/>&nbsp&nbsp&nbsp&nbsp　　据韩国《亚洲经济》消息，韩国百货店的高价中秋礼盒销量高于去年，整体业绩也增长不少。然而，虽然时逢中国国庆黄金周，但受“萨德”影响，访韩中国游客仍然寥寥，免税店销量依旧不振。<br/>&nbsp&nbsp&nbsp&nbsp　　国庆中秋长假之前，就有中国在线旅行社预测，国庆中秋长假期间，中国赴韩国旅游降幅最大，预计同比降下降七成左右，国庆赴韩旅游团全面中断。'},
          {tit:'台媒：大陆“黄金周”现出游新风貌 印证交通大发展',text:'&nbsp&nbsp&nbsp&nbsp　　台媒称，大陆的“十一黄金周”已成为很多人一年当中最重要的长假。虽然假期年年有，但回顾过去五年，无论是交通网络的快速发展，或出境旅游签证和移动支付的便利性，大陆的进步和发展让全球刮目相看，民众出游的方式也有了重大改变。<br/>&nbsp&nbsp&nbsp&nbsp　　据台湾中时电子报10月9日报道，大陆铁路总公司统计，今年十一假期已累计运输旅客1亿多人次，高铁客流占整体客流40%左右，刚启用不久的“复兴号”，更让人有机会以350公里的时速，一览大好河山。目前大陆平均每年投入7400多亿元人民币用于高铁兴建。2.2万公里的总里程，不但世界排名第一，更相当于第二名到第10名加起来的总和。<br/>&nbsp&nbsp&nbsp&nbsp　　报道称，截至2016年底，大陆全国高速公路总里程已达13.1万公里，居世界第一。2012年国庆长假开始，在重大节假日全面推行小客车高速免费通行政策，让人们出行更加便捷。逢山修路、遇水架桥更拉近了时空的距离。5年来，无数座新桥完工，光是长江上就已超过100座。再加上2500多个旅游集散中心、3000多条旅游风景道路，都让民众出游更便捷。'},
          {tit:'日商为迎合中国游客接入支付宝 引起日本金融界警惕',text:'&nbsp&nbsp&nbsp&nbsp　　有数据估计，在今年的国庆假期期间，将有超过600万的国人选择境外游。跟随着中国游客的脚步，不少国外的商家也开始使用中国先进的移动支付方式，如果没有支付宝、微信支付，就真的OUT了。<br/>&nbsp&nbsp&nbsp&nbsp　　近日，就有一位日本礼品店店主在日本知名论坛2ch上求助，询问如何开通支付宝。这位店主表示，最近中国的国庆长假给店里带来很多客人，这些客人常常询问能否使用支付宝。尽管店里已经支持VISA，但不能用支付宝还是让客人感到有些失望。<br/>&nbsp&nbsp&nbsp&nbsp　　不过，值得注意的是，中国移动支付在日本的“攻城略地”已经引起了日本金融界的警惕。'},
          {tit:'美国将扩大旅行禁令　新增朝鲜等3个国家',text:'&nbsp&nbsp&nbsp&nbsp　　据法新社报道，美国官员称将对伊朗、利比亚、叙利亚、也门、索马里、委内瑞拉、朝鲜、乍得实施旅行禁令。新的旅行禁令将于10月18日起生效。美国总统特朗普发推文表示，保证美国的安全是第一要务。<br/>&nbsp&nbsp&nbsp&nbsp　　此前据央视消息，当地时间22日下午，据美国政府高层官员透露，为期90天的旅行禁令即将到期，特朗普政府正在准备替换现行禁令，改为对具体国家实施不同的更具针对性的旅行禁令。目前白宫尚未透露关于新禁令的细节，仅通过声明表示：特朗普政府只会准许那些被严格审查，不会对国家安全或公共安全造成威胁的人员入境。<br/>&nbsp&nbsp&nbsp&nbsp　　据报道，在伦敦地铁爆炸案后，15日，特朗普在社交媒体上称，将出台“范围更广、更严格，更有针对性的”旅行禁令。华盛顿分析人士认为，无论出台何种新禁令，特朗普最终仍将受到最高法院的掣肘，禁令依然面对“被反对”、“被禁”加“被缩水”的可能。'}
        ],
        num:14,
        allLoaded: false,
        bottomStatus: '',
        time:''
      };
    },
    methods: {
      handleBottomChange(status) {
        this.bottomStatus = status;
      },
      loadBottom() {
        clearTimeout(this.time)
        this.time=setTimeout(() => {
          if (this.num < 1000) {
            this.num=this.num+14;
            for (let i = 0; i <14; i++) {
              this.kc.push(this.kc[i]);
            }
          } else {
            this.allLoaded = true;
          }
          this.$refs.loadmore.onBottomLoaded();
        }, 1000);
      },
      back(){
        this.$router.go(-1)
      }
    }
  };
</script>

